In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("C:\Codding\Jupyter\CSV\JEE_Rank_2016_2024.csv")

<>:1: SyntaxWarning: invalid escape sequence '\C'
<>:1: SyntaxWarning: invalid escape sequence '\C'
C:\Users\POOJA\AppData\Local\Temp\ipykernel_17424\2575122480.py:1: SyntaxWarning: invalid escape sequence '\C'
  df=pd.read_csv("C:\Codding\Jupyter\CSV\JEE_Rank_2016_2024.csv")

In [4]:
df.head()

,Institute,Quota,Gender,Year,Academic_Program_Name,Closing_Rank,Opening_Rank,Seat_Type
0,Indian Institute of Technology Bhubaneswar,AI,Gender-Neutral,2016,"Mechanical Engineering (4 Years, Bachelor of T...",651,583,ST
1,Indian Institute of Technology Bombay,AI,Gender-Neutral,2016,"Civil Engineering (4 Years, Bachelor of Techno...",21,21,OBC-NCL (PwD)
2,Indian Institute of Technology Bombay,AI,Gender-Neutral,2016,"Computer Science and Engineering (4 Years, Bac...",60,1,OPEN
3,Indian Institute of Technology Bombay,AI,Gender-Neutral,2016,Energy Engineering with M.Tech. in Energy Syst...,848,338,SC
4,Indian Institute of Technology Bombay,AI,Gender-Neutral,2016,Metallurgical Engineering and Materials Scienc...,2971,1657,OPEN

In [5]:
df.shape

(20834, 8)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20834 entries, 0 to 20833
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Institute              20833 non-null  object
 1   Quota                  20833 non-null  object
 2   Gender                 20833 non-null  object
 3   Year                   20834 non-null  int64
 4   Academic_Program_Name  20833 non-null  object
 5   Closing_Rank           20833 non-null  object
 6   Opening_Rank           20833 non-null  object
 7   Seat_Type              20833 non-null  object
dtypes: int64(1), object(7)
memory usage: 1.3+ MB

In [7]:
df = df.iloc[:,1:]

In [8]:
df.head()

,Quota,Gender,Year,Academic_Program_Name,Closing_Rank,Opening_Rank,Seat_Type
0,AI,Gender-Neutral,2016,"Mechanical Engineering (4 Years, Bachelor of T...",651,583,ST
1,AI,Gender-Neutral,2016,"Civil Engineering (4 Years, Bachelor of Techno...",21,21,OBC-NCL (PwD)
2,AI,Gender-Neutral,2016,"Computer Science and Engineering (4 Years, Bac...",60,1,OPEN
3,AI,Gender-Neutral,2016,Energy Engineering with M.Tech. in Energy Syst...,848,338,SC
4,AI,Gender-Neutral,2016,Metallurgical Engineering and Materials Scienc...,2971,1657,OPEN

In [9]:
df.columns

Index(['Quota', 'Gender', 'Year', 'Academic_Program_Name', 'Closing_Rank',
       'Opening_Rank', 'Seat_Type'],
      dtype='object')

In [10]:
df.tail()

,Quota,Gender,Year,Academic_Program_Name,Closing_Rank,Opening_Rank,Seat_Type
20829,AI,Female-only (including Supernumerary),2024,"Mechanical Engineering (4 Years, Bachelor of T...",9014,7628,OBC-NCL
20830,AI,Gender-Neutral,2024,"Mechanical Engineering (4 Years, Bachelor of T...",2629,1327,SC
20831,AI,Female-only (including Supernumerary),2024,"Mechanical Engineering (4 Years, Bachelor of T...",4303,4302,SC
20832,AI,Gender-Neutral,2024,"Mechanical Engineering (4 Years, Bachelor of T...",1213,664,ST
20833,AI,Female-only (including Supernumerary),2024,"Mechanical Engineering (4 Years, Bachelor of T...",1687,1687,ST

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
list(df.columns)

['Quota',
 'Gender',
 'Year',
 'Academic_Program_Name',
 'Closing_Rank',
 'Opening_Rank',
 'Seat_Type']

In [13]:
type(df[['Quota','Gender','Year',]])

pandas.core.frame.DataFrame

In [14]:
type(df['Year'])

pandas.core.series.Series

In [15]:
df.dtypes

Quota                    object
Gender                   object
Year                      int64
Academic_Program_Name    object
Closing_Rank             object
Opening_Rank             object
Seat_Type                object
dtype: object

In [19]:
df2=pd.read_excel("C:\Codding\Jupyter\EXL\Shiksha Academy.xlsx")

<>:1: SyntaxWarning: invalid escape sequence '\C'
<>:1: SyntaxWarning: invalid escape sequence '\C'
C:\Users\POOJA\AppData\Local\Temp\ipykernel_17424\795081933.py:1: SyntaxWarning: invalid escape sequence '\C'
  df2=pd.read_excel("C:\Codding\Jupyter\EXL\Shiksha Academy.xlsx")

In [21]:
df2.head()

,Student Detail(Shiksha Academy),Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,Sr.no,Student's Name,Father's Name,Mother's Name,Gender,Date Of Birth,Standard,School Name,Address,Contact Number,Admission date,Fees Date,Fees Amount,Last Date
1,1,Aastha Dhananjay Babar,Dhananjay Babar,Nilam Babar,Female,2015-04-22 00:00:00,3rd,Mother Teresa High School,"407,Hiravati Palace, Road No-2,Near Fire briga...",9637191765 / 9224440112,2024-01-28 00:00:00,1,450,NaN
2,2,Taimur Hasan Uddin,Hasan Uddin,Tabbassum Uddin,Male,2018-09-29 00:00:00,1st,The Tree House High School,"113,Hiravati Palace, Road No-2,Near Fire briga...",8827763739,2024-02-01 00:00:00,1,350,NaN
3,3,Tanmay Amol Chenage,Amol Chenage,Priyanka Chenage,Male,2014-12-19 00:00:00,3rd,Mother Teresa High School,"010,Hiravati Palace, Road No-2,Near Fire briga...",7350119188,2024-02-01 00:00:00,1,450,NaN
4,4,Devansh Amol Chenage,Amol Chenage,Priyanka Chenage,Male,2018-08-03 00:00:00,Sr.Kg,Mother Marry High Scool,"010,Hiravati Palace, Road No-2,Near Fire briga...",7350119188,2024-02-01 00:00:00,1,300,NaN

In [22]:
df2.columns

Index(['Student Detail(Shiksha Academy)', 'Unnamed: 1', 'Unnamed: 2',
       'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7',
       'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12',
       'Unnamed: 13'],
      dtype='object')

In [25]:
df2.dtypes

Student Detail(Shiksha Academy)    object
Unnamed: 1                         object
Unnamed: 2                         object
Unnamed: 3                         object
Unnamed: 4                         object
Unnamed: 5                         object
Unnamed: 6                         object
Unnamed: 7                         object
Unnamed: 8                         object
Unnamed: 9                         object
Unnamed: 10                        object
Unnamed: 11                        object
Unnamed: 12                        object
Unnamed: 13                        object
dtype: object

In [32]:
df3=pd.read_html('https://byjus.com/social-science/states-and-capitals/')

In [33]:
type(df3)

list

In [34]:
len(df3)

3

In [37]:
df3[0]

Empty DataFrame
Columns: [(States in North East India, Assam, Meghalaya, Arunachal Pradesh, Nagaland, Manipur, Mizoram, Tripura), (Capitals, Dispur, Shillong, Itanagar, Kohima, Imphal, Aizawl, Agartala)]
Index: []

In [38]:
df3[1]

Empty DataFrame
Columns: [(States in South India, Karnataka, Tamil Nadu, Andhra Pradesh, Telangana, Kerala, Goa), (Capitals, Bangalore, Chennai, Amaravati, Hyderabad, Trivandrum, Panaji)]
Index: []

In [39]:
df3[2]

Empty DataFrame
Columns: [(North, Central, East and Western India, Maharashtra, Gujarat, Rajasthan, Haryana, Punjab, Uttarakhand, Uttar Pradesh, Madhya Pradesh, Chhattisgarh, Jharkhand, Bihar, West Bengal, Odisha, Sikkim, Himachal Pradesh), (States and Capitals, Mumbai, Gandhinagar, Jaipur, Chandigarh, Chandigarh, Dehradun, Lucknow, Bhopal, Raipur, Ranchi, Patna, Kolkata, Bhubaneshwar, Gangtok, Shimla)]
Index: []

In [43]:
df3[0].to_csv("state_capital_NE.csv")

In [44]:
df3[1].to_csv("state_capital_S.csv")

In [45]:
df3[2].to_csv("state_capital.csv")